OpenFOAM-6-cantera-openmpi/tutorials/lagrangian/reactingParcelFoam/filter/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    walls
    {
        type            fixedFluxPressure;
    }

    inlet
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type            prghPressure;
        p               uniform 100000;
    }

    cycLeft_half0
    {
        type            cyclic;
    }

    cycRight_half0
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }

    cycLeft_half1
    {
        type            cyclic;
    }

    cycRight_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
